product/load-test/results/scenario1-lock/before/run4/compare.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m20s max duration (incl. graceful stop):
              * compare: 200 looping VUs for 1m0s (gracefulStop: 20s)

time="2026-08-05T13:32:33+09:00" level=info msg="초기 재고: 99993597" source=console

running (0m01.0s), 200/200 VUs, 201 complete and 0 interrupted iterations
compare   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 428 complete and 0 interrupted iterations
compare   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 568 complete and 0 interrupted iterations
compare   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 774 complete and 0 interrupted iterations
compare   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 1027 complete and 0 interrupted iterations
compare   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 1251 complete and 0 interrupted iterations
compare   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 1455 complete and 0 interrupted iterations
compare   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 1674 complete and 0 interrupted iterations
compare   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m09.0s), 200/200 VUs, 1920 complete and 0 interrupted iterations
compare   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m10.0s), 200/200 VUs, 2136 complete and 0 interrupted iterations
compare   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m11.0s), 200/200 VUs, 2375 complete and 0 interrupted iterations
compare   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m12.0s), 200/200 VUs, 2607 complete and 0 interrupted iterations
compare   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m13.0s), 200/200 VUs, 2839 complete and 0 interrupted iterations
compare   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m14.0s), 200/200 VUs, 3064 complete and 0 interrupted iterations
compare   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m15.0s), 200/200 VUs, 3294 complete and 0 interrupted iterations
compare   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m16.0s), 200/200 VUs, 3481 complete and 0 interrupted iterations
compare   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m17.0s), 200/200 VUs, 3627 complete and 0 interrupted iterations
compare   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m18.0s), 200/200 VUs, 3773 complete and 0 interrupted iterations
compare   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m19.0s), 200/200 VUs, 3984 complete and 0 interrupted iterations
compare   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m20.0s), 200/200 VUs, 4232 complete and 0 interrupted iterations
compare   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m21.0s), 200/200 VUs, 4444 complete and 0 interrupted iterations
compare   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m22.0s), 200/200 VUs, 4673 complete and 0 interrupted iterations
compare   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m23.0s), 200/200 VUs, 4912 complete and 0 interrupted iterations
compare   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m24.0s), 200/200 VUs, 5159 complete and 0 interrupted iterations
compare   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m25.0s), 200/200 VUs, 5399 complete and 0 interrupted iterations
compare   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m26.0s), 200/200 VUs, 5634 complete and 0 interrupted iterations
compare   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m27.0s), 200/200 VUs, 5849 complete and 0 interrupted iterations
compare   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m28.0s), 200/200 VUs, 6076 complete and 0 interrupted iterations
compare   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m29.0s), 200/200 VUs, 6293 complete and 0 interrupted iterations
compare   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m30.0s), 200/200 VUs, 6530 complete and 0 interrupted iterations
compare   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m31.0s), 200/200 VUs, 6776 complete and 0 interrupted iterations
compare   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m32.0s), 200/200 VUs, 7031 complete and 0 interrupted iterations
compare   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m33.0s), 200/200 VUs, 7275 complete and 0 interrupted iterations
compare   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m34.0s), 200/200 VUs, 7509 complete and 0 interrupted iterations
compare   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m35.0s), 200/200 VUs, 7749 complete and 0 interrupted iterations
compare   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m36.0s), 200/200 VUs, 7990 complete and 0 interrupted iterations
compare   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m37.0s), 200/200 VUs, 8210 complete and 0 interrupted iterations
compare   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m38.0s), 200/200 VUs, 8458 complete and 0 interrupted iterations
compare   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m39.0s), 200/200 VUs, 8700 complete and 0 interrupted iterations
compare   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m40.0s), 200/200 VUs, 8931 complete and 0 interrupted iterations
compare   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m41.0s), 200/200 VUs, 9176 complete and 0 interrupted iterations
compare   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m42.0s), 200/200 VUs, 9413 complete and 0 interrupted iterations
compare   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m43.0s), 200/200 VUs, 9653 complete and 0 interrupted iterations
compare   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m44.0s), 200/200 VUs, 9896 complete and 0 interrupted iterations
compare   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m45.0s), 200/200 VUs, 10107 complete and 0 interrupted iterations
compare   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m46.0s), 200/200 VUs, 10271 complete and 0 interrupted iterations
compare   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m47.0s), 200/200 VUs, 10386 complete and 0 interrupted iterations
compare   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m48.0s), 200/200 VUs, 10557 complete and 0 interrupted iterations
compare   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m49.0s), 200/200 VUs, 10727 complete and 0 interrupted iterations
compare   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m50.0s), 200/200 VUs, 10908 complete and 0 interrupted iterations
compare   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m51.0s), 200/200 VUs, 11130 complete and 0 interrupted iterations
compare   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m52.0s), 200/200 VUs, 11371 complete and 0 interrupted iterations
compare   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m53.0s), 200/200 VUs, 11610 complete and 0 interrupted iterations
compare   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m54.0s), 200/200 VUs, 11855 complete and 0 interrupted iterations
compare   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m55.0s), 200/200 VUs, 12099 complete and 0 interrupted iterations
compare   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m56.0s), 200/200 VUs, 12345 complete and 0 interrupted iterations
compare   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m57.0s), 200/200 VUs, 12559 complete and 0 interrupted iterations
compare   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m58.0s), 200/200 VUs, 12790 complete and 0 interrupted iterations
compare   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m59.0s), 200/200 VUs, 13010 complete and 0 interrupted iterations
compare   [  98% ] 200 VUs  0m59.0s/1m0s

running (1m00.0s), 200/200 VUs, 13246 complete and 0 interrupted iterations
compare   [ 100% ] 200 VUs  1m00.0s/1m0s
time="2026-08-05T13:33:34+09:00" level=info msg="초기 재고: 99993597" source=console
time="2026-08-05T13:33:34+09:00" level=info msg="최종 재고: 99980142" source=console
time="2026-08-05T13:33:34+09:00" level=info msg="차감된 수량: 13455" source=console
time="2026-08-05T13:33:34+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_duration{scenario:compare}
    ✓ 'max>=0' max=1.68s

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    http_reqs{scenario:compare}
    ✓ 'count>=0' count=13455

    stock_decrease_successes{scenario:compare}
    ✓ 'count>=0' count=13455

    stock_lock_timeout_rate{scenario:compare}
    ✓ 'rate>=0' rate=0.00%

    stock_lock_timeouts{scenario:compare}
    ✓ 'count>=0' count=0

    stock_unexpected_failures
    ✓ 'count==0' count=0

      {scenario:compare}
      ✓ 'count>=0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 13455   221.344128/s
    checks_succeeded...: 100.00% 13455 out of 13455
    checks_failed......: 0.00%   0 out of 13455

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 13455  221.344128/s
      { scenario:compare }..........: 13455  221.344128/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 13455
      { scenario:compare }..........: 0.00%  0 out of 13455
    stock_lock_timeouts.............: 0      0/s
      { scenario:compare }..........: 0      0/s
    stock_unexpected_failure_rate...: 0.00%  0 out of 13455
    stock_unexpected_failures.......: 0      0/s
      { scenario:compare }..........: 0      0/s

    HTTP
    http_req_duration...............: avg=896.92ms min=6.02ms  med=854.91ms max=1.68s p(90)=1.07s p(95)=1.25s p(99)=1.49s
      { expected_response:true }....: avg=896.92ms min=6.02ms  med=854.91ms max=1.68s p(90)=1.07s p(95)=1.25s p(99)=1.49s
      { scenario:compare }..........: avg=897.05ms min=35.71ms med=854.92ms max=1.68s p(90)=1.07s p(95)=1.25s p(99)=1.49s
    http_req_failed.................: 0.00%  0 out of 13457
    http_reqs.......................: 13457  221.377029/s
      { scenario:compare }..........: 13455  221.344128/s

    EXECUTION
    iteration_duration..............: avg=897.43ms min=37.34ms med=855.16ms max=1.68s p(90)=1.07s p(95)=1.26s p(99)=1.5s 
    iterations......................: 13455  221.344128/s
    vus.............................: 200    min=200        max=200
    vus_max.........................: 200    min=200        max=200

    NETWORK
    data_received...................: 8.0 MB 132 kB/s
    data_sent.......................: 2.6 MB 43 kB/s



running (1m00.8s), 000/200 VUs, 13455 complete and 0 interrupted iterations
compare ✓ [ 100% ] 200 VUs  1m0s